# 1 - 1/1
# 2 - 1/2
# 3 - 2/1
# 4 - 3/1
# 5 - 2/2
# 6 - 1/3
# 7 - 1/4
# 8 - 2/3
# 9 - 3/2
# 14 - 2/4
#1줄 - 1
#2줄 - 2 3
#3줄 - 4 5 6
#4줄 - 7 8 9 10

#1줄 - 1/1
#2줄 - 1/2 2/1
#3줄 - 3/1 2/2 1/3
#4줄 - 1/4 2/3 3/2 4/1
#5줄 - 5/1 4/2 3/3 2/4 1/5
#6줄 - 1/6 2/5 3/4 4/3 5/2 6/1 ...
#def getLine(N):
N = int(input())
line = 1
while N > line:
    N -= line
    line += 1 


if line % 2 == 0:
    up = N
    down = line - N + 1
else:
    up = line - N + 1
    down = N

print(str(up) + "/" + str(down))